milling/rhoSimpleFoamLshape/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    rotor
    {
        type            noSlip;
    }
    outlet
    {
        type            zeroGradient;
    }
    stator
    {
        type            noSlip;
    }
    nozzle
    {
        type            noSlip;
    }
    inlet // fixed value velocity fails - trying mass flow rate - fixing rho at inlet  
    {
        type            flowRateInletVelocity;
        rhoInlet        1000;    // Guess for rho
        massFlowRate    constant 5e1;
    }
    axis
    {
        type            noSlip;  
    } 
    bottomEmptyFaces
    {
        type            wedge;
    }
    topEmptyFaces
    {
        type            wedge;
    }
}


// ************************************************************************* //
