milling/rhoSimpleFoamLshape/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    rotor
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           $internalField;
    }
    outlet
    {
        type            calculated;
        value           $internalField; 
    }
    stator
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           $internalField;
    }
    nozzle
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           $internalField;
    }
    inlet
    {
        type            calculated;
        value           $internalField;
    }
    axis
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           $internalField;
    } 
    bottomEmptyFaces
    {
        type            wedge;
    }
    topEmptyFaces
    {
        type            wedge;
    }
}


// ************************************************************************* //
