milling/rhoSimpleFoamLshape/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                |
| \\      /  F ield         | cfMesh: A library for mesh generation          |
|  \\    /   O peration     |                                                |
|   \\  /    A nd           | Author: Franjo Juretic                         |
|    \\/     M anipulation  | E-mail: franjo.juretic@c-fields.com            |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-06;
        relTol           1e-6;
    };

    "(U|e|k|epsilon)"  
    {
        solver           PBiCG;
        preconditioner   DILU;
        tolerance        1e-06;
        relTol           0.1;
    };
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    pMinFactor      0.1;
    pMaxFactor      1.5;

    transonic       no;
    consistent      no;

    residualControl
    {
        p               1e-2; // not sure what accuracy is required 
        U               1e-2;
        "(k|omega|epsilon|e|h)" 1e-2;
    }
}

relaxationFactors
{
    fields
    {
        p               0.5; // 0.3;
        U               0.5;
        e               0.5;
        k               0.5; 
        epsilon         0.5; 
    }
    equations
    {
        U               0.5;
        e               0.5;
        k               0.5;
        epsilon         0.5;
    }
}

// ************************************************************************* //
